Documents/Инкассация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Инкассация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперационнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выдано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Договор</v8:Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Инкассация/Ext/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ТабДок = ПечатьИнкассации(МассивОбъектов, ОбъектыПечати);
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Инкассация", "Инкассация", ТабДок,, "Документ.Инкассация.Инкассация");
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Функция ПечатьИнкассации(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДокИнкассация = Новый ТабличныйДокумент;
	
	Макет = Документы.Инкассация.ПолучитьМакет("Инкассация");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Платежи = Макет.ПолучитьОбласть("Платежи");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Разрез = Макет.ПолучитьОбласть("Разрез");
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Инкассация.Дата КАК КонецПериода,
	|	Инкассация.Ссылка,
	|	Инкассация.Подразделение,
	|	Инкассация.Инкассатор,
	|	Инкассация.Номер,
	|	Инкассация.ОперационнаяКасса,
	|	Инкассация.ПериодНачало КАК НачалоПериода,
	|	Инкассация.СуммаДокумента,
	|	Инкассация.СписокДокументов.(
	|		НомерСтроки,
	|		Регистратор,
	|		Основание,
	|		Принято,
	|		Выдано
	|	),
	|	Инкассация.Офис
	|ИЗ
	|	Документ.Инкассация КАК Инкассация
	|ГДЕ
	|	Инкассация.Ссылка В(&Ссылка)
	|	И Инкассация.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Инкассация.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		ТабДокИнкассация.Очистить();
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		СальдоНачальное = ЛексСервер.ПолучитьОстатокОперационнойКассыНаДату(Выборка.НачалоПериода, Выборка.ОперационнаяКасса, Выборка.Подразделение);
		ИтогоПринято = Выборка.Ссылка.СписокДокументов.Итог("Принято"); //// ааааааааааааа
		ИтогоВыдано = Выборка.Ссылка.СписокДокументов.Итог("Выдано");
		СальдоКонечное = СальдоНачальное + ИтогоПринято -ИтогоВыдано - Выборка.СуммаДокумента;
		
		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.НачалоПериода = Формат(Выборка.НачалоПериода, "ДЛФ=DD");
		Шапка.Параметры.КонецПериода = Формат(Выборка.КонецПериода, "ДЛФ=DD");
		Шапка.Параметры.СальдоНачальное = СальдоНачальное;
		
		ТабДокИнкассация.Вывести(Шапка, Выборка.Уровень());
		
		ВыборкаСписокДокументов = Выборка.СписокДокументов.Выбрать();
		Пока ВыборкаСписокДокументов.Следующий() Цикл
			Платежи.Параметры.Заполнить(ВыборкаСписокДокументов);
			ТабДокИнкассация.Вывести(Платежи, ВыборкаСписокДокументов.Уровень());
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.НачалоПериода = Формат(Выборка.НачалоПериода, "ДЛФ=DD");
		Подвал.Параметры.КонецПериода = Формат(Выборка.КонецПериода, "ДЛФ=DD");
		Подвал.Параметры.СуммаПрописью = ЧислоПрописью(Выборка.СуммаДокумента, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		Подвал.Параметры.СальдоКонечное = СальдоКонечное;
		Подвал.Параметры.ИтогПринято = ИтогоПринято;
		Подвал.Параметры.ИтогВыдано = ИтогоВыдано;
		
		ТабДокИнкассация.Вывести(Подвал);
		
		ТабДок.Вывести(ТабДокИнкассация);
		ТабДок.Вывести(Разрез);
		ТабДок.Вывести(ТабДокИнкассация);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры
